index.html

<html>
<head>
    <title>TC KİMLİK DOĞRULAMA SOAP JAVASCRİPT</title>
    <script type="text/javascript">
        function soap() {
            var xmlhttp = new XMLHttpRequest();
            xmlhttp.open('POST', 'https://tckimlik.nvi.gov.tr/Service/KPSPublic.asmx?WSDL', true);
			var TCNO = document.getElementById('tcno');
			var ADI = document.getElementById('adi');
			var SOYADI = document.getElementById('soyadi');
			var DOGUMYILI = document.getElementById('dogumyili');

            var sr =
                '<?xml version="1.0" encoding="utf-8"?>'+
				'<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">'+
				  '<soap:Body>' +
					'<TCKimlikNoDogrula xmlns="http://tckimlik.nvi.gov.tr/WS">'+
					  '<TCKimlikNo>'+TCNO+'</TCKimlikNo>'+
					  '<Ad>'+ADI+'</Ad>'+
					  '<Soyad>'+SOYADI+'</Soyad>'+
					  '<DogumYili>'+DOGUMYILI+'</DogumYili>'+
					'</TCKimlikNoDogrula>'+
				  '</soap:Body>'+
				'</soap:Envelope>';

            xmlhttp.onreadystatechange = function () {
			console.log(xmlhttp);
                if (xmlhttp.readyState == 4) {
                    if (xmlhttp.status == 200) {
                        alert(xmlhttp.responseText);
                        
                    }
                }
            }
            // Send the POST request
            xmlhttp.setRequestHeader('Content-Type', 'text/xml');
            xmlhttp.send(sr);
            // send request
            // ...
        }
    </script>
</head>
<body>
    <form name="Demo" action="" method="post">
		<label>TC Kimlik No:<br>
			<input type="number" name ="tcno" id="adi" max="10000000000" min="99999999999" />
	</label><br>
	<label>Adınız:<br>
			<input type="text" name ="ad" id="adi" />
	</label><br>
		<label>Soyadınız:<br>
			<input type="text" name ="soyad" id="soyadi" />
	</label><br>
	<label>Doğum Yılı:<br>
			<input type="number" name ="dogumyili"  id="dogumyili" />
	</label><br>
        <div>
            <input type="button" value="Soap" onclick="soap();" />
        </div>
    </form>
</body>
</html> <!-- typo -->